emacs.org
## -*- Mode: Org-Mode; -*-
#
# emacs.org --- André Beyer <beyeran@gmail.com>
# Time-stamp: <2012-08-27 20:29:32 beyeran>
#
#+STARTUP: indent
#+STARTUP: hidestars

* Essentials
** Macros
#+begin_src emacs-lisp :tangle emacs.el
;;
;; file: emacs.el
;;


;; some macros
(defmacro sys-diversification (gnu/linux &optional darwin win)
  "System diversification for Linux, Mac and Windows, focus on Linux"
  `(cond ((sys-type 'darwin) ,darwin)
         ((sys-type 'gnu/linux) ,gnu/linux)
         ((sys-type 'windows-nt) ,win)
         (t nil)))

(defun sys-type (name)
  (if (eq system-type name)
      t
    nil))

(defmacro require-beyeran (name)
  (let ((require-symbol (intern (concat "beyeran-" name))))
    `(require ',require-symbol)))

(defun flatten (x)
  (cond ((null x) nil)
        ((listp x) (append (flatten (car x))
                           (flatten (cdr x))))
        (t (list x))))
#+end_src
** Init File
#+begin_src emacs-lisp :tangle emacs.el

;; possible differences between paths
(setq explicit-shell-file-name "/bin/zsh")
(setq shell-file-name "zsh")
(setenv "SHELL" shell-file-name)
(add-hook 'comint-output-filter-functions 'comint-strip-ctrl-m)

;; functions for loading the right folder
(setq dotfiles-dir (file-name-directory
  (or (buffer-file-name) load-file-name)))

(setq beyeran-dir (concat dotfiles-dir "beyeran/"))
(setq extensions-dir (concat dotfiles-dir "extensions/"))

(setq color-theme-dir (concat dotfiles-dir "custom-color-themes/"))
(setq beyeran-color-theme-dir (concat color-theme-dir "beyeran/"))

(add-to-list 'load-path dotfiles-dir)
(add-to-list 'load-path beyeran-dir)
(add-to-list 'load-path extensions-dir)

(add-to-list 'custom-theme-load-path beyeran-color-theme-dir)
;; testing:
(add-to-list 'custom-theme-load-path (concat color-theme-dir "solarized/"))

(defun add-to-loadpath (name)
  (add-to-list 'load-path (concat extensions-dir name)))

(defun load-multiple (folder-list)
  (mapcar #'(lambda (n)
              (add-to-loadpath n)) folder-list))
#+end_src
** Loading Paths
#+begin_src emacs-lisp :tangle emacs.el

(setq *extension-list* '("color-theme" 
                         "paredit"
                         "org-mode"
                         "org-mode/lisp"
                         "ido"
                         "ruby-mode"
                         "haskell-mode"
                         "haskell-indent"
                         "clojure-mode"
                         "swank-clojure"
                         "prolog"
                         "scheme"
                         "scss-mode"
                         "smex"
                         "ess"
                         "ess/lisp"
                         "coffee-mode"
                         "shen-mode"
                         "maxima"
                         "java"))

(sys-diversification
 (append *extension-list* '("/usr/share/emacs/site-lisp/slime/")))

(load-multiple *extension-list*)
#+end_src
** Requirements
#+begin_src emacs-lisp :tangle emacs.el

;; requiring local files

(require-beyeran "misc")
(require-beyeran "auto-insert")
(require-beyeran "paredit")
(require-beyeran "smex")
(require-beyeran "org")
(require-beyeran "org-babel")
(require-beyeran "org-reftex")
(require-beyeran "org-export-templates")
(require-beyeran "jekyll")
(require-beyeran "ruby-mode")
(require-beyeran "haskell-mode")
(require-beyeran "clojure-mode")
(require-beyeran "prolog-mode")
;(require-beyeran "shen-mode")
;;(require-beyeran "scheme-mode")
;(require-beyeran "scss-mode")
;(require-beyeran "coffee-mode")
(require-beyeran "ess")
(require-beyeran "gtd")
;(require-beyeran "maxima")
;(require-beyeran "java")
(require-beyeran "octave")
;;(require-beyeran "erlang-mode")
(require-beyeran "slime")

#+end_src
* General Stuff
  In here there is some general stuff which means: some settings
  (tool-bar, curser etc).
** HUD & general Information
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;
;; file: beyeran-misc.el
;;

;;;;;;;; general stuff ;;;;;;;
(require 'cl)

(tool-bar-mode 0)
(menu-bar-mode 0)
(scroll-bar-mode 0)
(show-paren-mode 1)
(fringe-mode 0)

(setq linum-format "%d ")

(setq inhibit-spalsh-screen nil)
(setq completion-cycle-threshold 5)

(custom-set-faces
  '(default ((t (:background "#000000" :foreground "#a6a6a6"
                 :height 80 :family "Droid Sans Mono")))))


(setq inihibit-startup-echo-area-message "André")
(setq inhibit-startup-screen t)
(setq initial-scratch-message nil)

;; Alt as Meta for Mac (german keyboard layout fix)

(sys-diversification
 ()
 (progn
   (setq mac-command-modifier 'meta
         mac-option-modifier 'none
         default-input-method "MacOSX")))

#+end_src
