emacs.org
** Haskell 
#+begin_src emacs-lisp :tangle beyeran/beyeran-haskell-mode.el
(add-to-list 'auto-mode-alist '("\\.hs$" . haskell-mode))

;;;; Variables ;;;;
(setq haskell-program-name "ghci"
      haskell-font-lock-symbols t)

(defun custom-haskell-mode ()
  (haskell-indentation-mode -1)
  (haskell-indent-mode 1)
  (flyspell-prog-mode))

(add-hook 'haskell-mode-hook 'custom-haskell-mode)
(add-hook 'haskell-mode-hook 'turn-on-haskell-simple-indent)

;;;; Hooks and Keys ;;;;
(setq haskell-hoogle-command "hoogle")

(defun add-haskell-hooks ()
  (add-hook 'haskell-mode-hook 'turn-on-haskell-doc-mode)
  (add-hook 'haskell-mode-hook 'turn-on-haskell-font-lock)
  (add-hook 'haskell-mode-hook 'turn-on-haskell-decl-scan)
  (add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
  (add-hook 'haskell-mode-hook 
	    (lambda ()
	      (define-keys haskell-mode-map
		'(("RET" newline)
		  ("TAB" haskell-indent-cycle)
		  ("C-c =" haskell-indent-insert-equal)
		  ("C-c |" haskell-indent-insert-guard)
		  ("C-c o" haskell-indent-insert-otherwise)
		  ("C-c w" haskell-indent-insert-where)
		  ("C-c ." haskell-indent-align-guards-and-rhs)
		  ("C-c i" inferior-haskell-info)))))
  (add-hook 'inferior-haskell-mode-hook
	    (lambda ()
	      (local-set-key (kbd "C-c h") 'haskell-hoogle)
	      (turn-on-haskell-doc-mode 1))))


;;;; Requirements ;;;;
(when (and (require 'haskell-mode "haskell-mode" t)
	   (require 'inf-haskell "inf-haskell" t)
       (require 'haskell-indent "haskell-indent" t))
  (add-haskell-hooks))

(provide 'beyeran-haskell-mode)
#+end_src

** Ruby
#+begin_src emacs-lisp :tangle beyeran/beyeran-ruby-mode.el
(autoload 'ruby-mode "ruby-mode"
  "Mode for editing ruby source files" t)

(require 'inf-ruby)

(add-to-list 'auto-mode-alist '("\\.rb$" . ruby-mode))
(add-to-list 'interpreter-mode-alist '("ruby" . ruby-mode))

(autoload 'run-ruby "inf-ruby" "Run an inferior Ruby process")
(autoload 'inf-ruby-keys "inf-ruby"
  "Set local key defs for inf-ruby in ruby-mode")

(add-hook 'ruby-mode-hook
  '(lambda () (inf-ruby-keys)))
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-ruby-mode.el
(provide 'beyeran-ruby-mode)
#+end_src
** Clojure
#+begin_src emacs-lisp :tangle beyeran/beyeran-clojure-mode.el
(setq clojure-src-root (expand-file-name "~/.emacs.d/extensions"))

(autoload 'clojure-mode "clojure-mode" t)
(autoload 'clojure-test-mode "clojure-test-mode" nil t)

(progn
  (autoload 'swank-clojure-init "swank-clojure")
  (autoload 'swank-clojure-slime-mode-hook "swank-clojure")
  (autoload 'swank-clojure-cmd "swank-clojure")
  (autoload 'swank-clojure-project "swank-clojure"))

;; Java starves programs by default
(setq swank-clojure-extra-vm-args (list "-Xmx1024m"))

(add-to-list 'auto-mode-alist '("\\.clj$" . clojure-mode))

(provide 'beyeran-clojure-mode)
#+end_src

** Prolog
#+begin_src emacs-lisp :tangle beyeran/beyeran-prolog-mode.el
(autoload 'run-prolog "prolog" "Start a Prolog sub-process." t)
(autoload 'prolog-mode "prolog" "Major mode for editing Prolog programs." t)
(autoload 'mercury-mode "prolog" "Major mode for editing Mercury programs." t)

(setq prolog-system 'swi)
(setq auto-mode-alist (append '(("\\.pl$" . prolog-mode)
                                ("\\.m$" . mercury-mode))
                                 auto-mode-alist))

(setq prolog-program-name "/usr/bin/gprolog")

(provide 'beyeran-prolog-mode)
#+end_src
** Shen
#+begin_src emacs-lisp :tangle beyeran/beyeran-shen-mode.el
(require 'shen-mode)
(require 'inf-shen)

(add-to-list 'auto-mode-alist '("\\.shen$" . shen-mode)
                              '("\\.kl$" . shen-mode))

(setq inferior-shen-program "/usr/bin/shen")

(provide 'beyeran-shen-mode)
#+end_src
** Scheme
#+begin_src emacs-lisp :tangle beyeran/beyeran-scheme-mode.el
(require 'quack)
(add-to-list 'auto-mode-alist '("\\.scm$" . scheme-mode))

(setq scheme-program-name "guile")

(add-to-list 'Info-default-directory-list (concat extensions-dir "scheme/info/"))

(add-hook 'scheme-mode-hook
          (lambda ()
            (define-key scheme-mode-map [f1]
              '(lambda ()
                 (interactive)
                 (ignore-errors
                   (let ((symbol (thing-at-point 'symbol)))
                        (info "(r5rs)")
                        (Info-index symbol)))))))

(provide 'beyeran-scheme-mode)
#+end_src
** Python
#+begin_src emacs-lisp :tangle beyeran/beyeran-python-mode.el
(add-to-list 'interpreter-mode-alist '("/usr/bin/python2" . python-mode))

(provide 'beyeran-python-mode)
#+end_src

** Scss
#+begin_src emacs-lisp :tangle beyeran/beyeran-scss-mode.el
(require 'scss-mode)

(sys-diversification
 ()
 (setq scss-sass-command "~/.rvm/gems/ruby-1.9.3-p0/bin/sass"))

(add-to-list 'auto-mode-alist '("\\.scss\\'" . scss-mode))
(add-to-list 'auto-mode-alist '("\\.sass\\'" . scss-mode))

(provide 'beyeran-scss-mode)
#+end_src
** Coffee-Script

#+begin_src emacs-lisp :tangle beyeran/beyeran-coffee-mode.el
(require 'coffee-mode)

(add-to-list 'auto-mode-alist '("\\.coffee$" . coffee-mode))
(add-to-list 'auto-mode-alist '("Cakefile" . coffee-mode))

(defun coffee-custon ()
  "coffee-mode-hook"
  (set (make-local-variable 'tab-width) 2))

(add-hook 'coffee-mode-hook
  '(lambda () (coffee-custom)))

(provide 'beyeran-coffee-mode)
#+end_src
** Erlang
#+begin_src emacs-lisp :tangle beyeran/beyeran-erlang-mode.el
(setq load-path (cons "/usr/lib/erlang/lib/tools-2.6.7/emacs/" load-path))

(setq erlang-root-dir "/usr/lib/erlang/")

(setq exec-path (cons "/usr/bin/" exec-path))

(require 'erlang-start)


(provide 'beyeran-erlang-mode)
#+end_src
** Slime
  I've installed quicklisp and in one documentation for it I've found
  this "slime helper" which works quite fine. There will be some
  additions for Scheme and Clojure development.

  ;;;;;;;; slime helper (from quicklisp)
  (load (expand-file-name "~/.config/quicklisp/slime-helper.el"))
  ;; (setq inferior-lisp-program "/Applications/CCL/dx86cl64")
  ;; (setq inferior-lisp-program "/Applications/AllegroCL/alisp")
  (setq inferior-lisp-program "/usr/bin/ccl")

#+begin_src emacs-lisp :tangle beyeran/beyeran-slime.el
(load (expand-file-name "~/.quicklisp/slime-helper.el"))

(require 'slime "slime" t)
(require 'w3m-load)

(setq browse-url-browser-function 'w3m)

;; (defun w3m-browse-url-other-window (url &optional new-window)
;;   (interactive (browse-url-interactive-arg "w3m URL: "))
;;   (let ((pop-up-frames nil))
;; 	(switch-to-buffer-other-window
;; 	 (w3m-get-buffer-create *w3m*))
;; 	(w3m-browse-url url)))
;; 
;; (setq browse-url-browser-function
;;   (list (cons "^ftp:/.*" (lambda (url &optional nf)
;; 						   (call-interactively #'find-file-at-point url)))
;; 		(cons "." #'w3m-browse-url-other-window)))


(slime-setup '(slime-fancy slime-asdf slime-references slime-indentation))

(setq slime-enable-evaluate-in-emacs t slime-net-coding-system 'utf-8-unix)

(add-hook 'slime-mode-hook
          (lambda ()
            (define-keys slime-mode-map
                '(("C-c s" slime-selector)
                  ("C-j" newline-and-indent)
                  ("TAB" slime-indent-and-complete-symbol)
                  ("C-c C-d c" cltl2-lookup)))))

(add-hook 'slime-repl-mode-hook
          (lambda ()
            (define-keys slime-repl-mode-map
                '(("C-c s" slime-selector)
                  ("C-c C-d c" cltl2-lookup)))))

(defun clojure-slime-config ()
  (require 'slime-autoloads)
  
  (slime-setup '(slime-fancy))

  (setq swank-clojure-classpath
        (list
         (concat clojure-src-root "/clojure/clojure.jar")
         (concat clojure-src-root "/clojure-contrib/target/clojure-contrib-1.2.0-SNAPSHOT.jar")
         (concat clojure-src-root "/swank-clojure/src")
         (concat clojure-src-root "/clojure/test/clojure/test_clojure")))

  (eval-after-load 'slime
    '(progn (require 'swank-clojure)
            (setq slime-lisp-implementations
                  (cons `(clojure ,(swank-clojure-cmd) :init
                                  swank-clojure-init)
                        (remove-if #'(lambda (x) (eq (car x) 'clojure))
                                   slime-lisp-implementations))))))

;; http://groups.google.com/group/clojure/browse_thread/thread/e70ac373b47d7088 
(add-to-list 'slime-lisp-implementations
             (sys-diversification 
              '(sbcl ("/usr/bin/sbcl"))
              '(ccl ("/Applications/CCL/dx86cl"))))


(defun pre-slime-clj (&optional clj-p)
  "Stuff to do before SLIME runs" 
  (unless (eq clj-p nil)
    (clojure-slime-config))
  (slime-setup '(slime-fancy)))


(defun run-clojure () 
  "Starts clojure in Slime" 
  (interactive)
  (pre-slime-clj t)
  (slime 'clojure))

(defun run-lisp () 
  "Starts SBCL in Slime" 
  (interactive) 
;;  (pre-slime-clj)
  (sys-diversification
   (slime 'sbcl)
   (slime 'ccl)))

#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-slime.el
(provide 'beyeran-slime)
#+end_src
** Maxima
#+begin_src emacs-lisp :tangle beyeran/beyeran-maxima.el
(autoload 'imaxima "imaxima" "maxima frontend" t)
(autoload 'imath "imath" "interactive math mode" t)

(provide 'beyeran-maxima)
#+end_src
** Java
#+begin_src emacs-lisp :tangle beyeran/beyeran-java.el
(require 'javarun)
(add-hook 'java-mode-hook (lambda () (javarun-mode 1)))
(setq javarun-java-path "/usr/bin")

(provide 'beyeran-java)
#+end_src

** Octave
#+begin_src emacs-lisp :tangle beyeran/beyeran-octave.el
(autoload 'octave-mode "octave-mod" nil t)

(sys-diversification ()
  (setq inferior-octave-program "/Applications/Octave.app/Contents/Resources/bin/octave"))

(setq auto-mode-alist
      (cons '("\\.m$" . octave-mode) auto-mode-alist))

(add-hook 'octave-mode-hook
          (lambda () 
            (abbrev-mode 1)
            (auto-fill-mode 1)
            (if (eq window-system 'x)
                (font-lock-mode 1))))

(provide 'beyeran-octave)
#+end_src
